//
//  Data.swift
//  fgo animation
//
//  Created by User12 on 2020/4/14.
//  Copyright © 2020 hunteruf. All rights reserved.
//

import Foundation

struct characters {
    var name: String
    var cv: String
    var introduce: String
}

struct episode{
    var Num : String
    var Head: String
    var Plot: String
}
let Everyone = [
    characters(name:"藤丸立香",cv:"島崎信長",introduce:"    原本是人理延續保障機構·迦勒底的御主候補。為了填補人員空缺而被找來的“新手”。然而在經歷迦勒底全滅的爆炸事故後，成為了唯一倖存下來的能夠穿越特異點的御主，現在正在持續著修復特異點的旅程。"),
    characters(name:"瑪修·基利艾拉特",cv:"高橋李依",introduce:"    人理延續保障機構·迦勒底的工作人員，在過去發生的“某件事情”後擁有了亞從者的能力。職階為Shielder。在爆炸事故後，與藤丸一起踏上了修復特異點的旅程。稱呼藤丸為“前輩”。"),
    characters(name:"芙芙",cv:"川澄綾子",introduce:"    在瑪修肩膀上的可愛動物。與藤丸、瑪修在進行著各特異點的旅行。平時在迦勒底自由地散步。"),
    characters(name:"羅馬尼·阿基曼",cv:"鈴村健一",introduce:"    原本是擔任人理延續保障機構迦勒底的醫療部門負責人的醫生，在爆炸事故後擔任迦勒底暫定的最高負責人。通稱“羅曼醫生”。雖然是個抗壓能力弱，有點膽小的溫柔男子，但同時也是個全力引導藤丸等人的旅程的可靠存在。虛擬偶像“魔法☆梅莉”的粉絲。"),
    characters(name:"李奧納多·達文西",cv:"坂本真綾",introduce:"    迦勒底英靈召喚的第三號成功例。迦勒底技術局的特別名譽顧問。職階為Caster。曾經在歐洲的各個領域留下了巨大的成就，被稱為“全能天才”的超級天才。因為太過於愛自己的傑作“蒙娜麗莎”而以其容姿再次出現在了現世。在穿越特異點這方面上提供技術支持。"),
    characters(name:"吉爾伽美什",cv:"關智一",introduce:"    在摯友恩奇都死後所啟程的不老不死之旅中歸來，現在為統治著古代美索不達米亞·烏魯克之地的賢王。在傳說中被稱為“見證一切之人”。時而冷酷。時而通理人情，嚴格領導著子民。"),
    characters(name:"恩奇都",cv:"小林優",introduce:"    經眾神之手製造而出的人偶，擁有超高戰鬥能力的“持有意識的寶具”。同時亦是自然和協調·一體化的大地分身，儘管作為吉爾伽美甚唯一的朋友經歷了諸多的冒險，卻仍還是在得到心靈之後，以人偶之身重歸大地。"),
    characters(name:"西杜麗",cv:"內山夕實",introduce:"輔佐統治烏魯克的賢王的神官。熱愛烏魯克，總是待在賢王身邊的頭腦聰慧且舉止優雅的淑女。溫柔賢惠且善於照顧他人，被烏魯克子民所敬仰。由於深受賢王信賴，因此在他面前都是毫無顧忌地直抒己見。"),
    characters(name:"梅林",cv:"櫻井孝宏",introduce:"    吉爾伽美甚通過英靈召喚所召喚的從者。職階為Caster。真實身份是亞瑟王傳說中所出現的宮廷魔術師，人類與夢魔之間的混血兒。身為魔法師的能力處於最高位的水平，也是“看清世界之眼”——“千里眼”的持有者。"),
    characters(name:"安娜",cv:"淺川悠",introduce:"    受到聖杯的影響而顯現在了烏魯克之地，沒有禦主的“流浪從者”。職階為Lancer。為了實現某個目的而與梅林一起行動。溫和敦厚，拒絕和他人溝通交流的少女。特別討厭梅林。"),
    characters(name:"伊絲塔",cv:"植田佳奈",introduce:"    掌管豐收與戰爭、以及金星等諸多神性的美索不達米亞的女神。職階為Archer。自由自在的性格，非常喜歡寶石等美麗的事物。與吉爾伽美甚有著因緣，經常驅使“天舟馬安娜”襲擊烏魯克，但每次的結果都是落荒而逃。"),
    characters(name:"牛若丸",cv:"早見沙織",introduce:"吉爾伽美甚召喚出來的鎮守烏魯克北面城牆的威風凜凜的從者。職階為Rider。在戰場上冷酷無情，有著極高的天賦才能，同時也有明朗活潑、親近友善、對主君十分忠誠的一面。"),
    characters(name:"武藏坊弁慶",cv:"稻田徹",introduce:"    吉爾伽美甚召喚出來的鎮守烏魯克北面城牆的肉體強健的僧兵從者。職階為Lancer。即便是現代，在各種故事傳說種也都是廣受愛戴的形象。平時豪快爽朗，同時又有著厭惡戰爭的熱愛和平的一面。"),
    characters(name:"列奧尼達一世",cv:"三木真一郎",introduce:"    吉爾伽美甚召喚出來的鎮守烏魯克北面城牆的滿腦肌肉的從者。職階為Lancer。以為了守護希臘而率領岌岌三百人的斯巴達軍隊抵擋了波斯大軍的入侵而為人所知。"),
    characters(name:"豹人",cv:"伊藤美紀",introduce:"    顯現現界原因仍不明的從者，很有可能是跟隨某個從者一起來到現界。職階為Lancer。充滿野性，自由奔放完全就是她的代名詞。穿在身上的似乎不是玩偶裝，而是“豹子的毛皮”……"),
    characters(name:"戈爾貢",cv:"淺川悠",introduce:"    擔任三女神同盟的盟主，企圖滅絕人類的從者。職階為Avenger。以烏魯克北面的山岳地帶為據點，有著能夠化作蟒蛇的觸手，已經是應該被稱為魔獸女王的存在了。"),
    characters(name:"魁札爾・科亞特爾",cv:"遠藤綾",introduce:"    三女神同盟的一柱，以烏魯克南方為據點的從者。職階為Rider。儘管她的性格像太陽一樣熾熱明亮，卻會在正面戰鬥中顯露出兇猛殘酷的一面。"),
    characters(name:"艾蕾什基伽勒",cv:"植田佳奈",introduce:"    三女神同盟的一柱，以冥界為據點的女神。性格認真，甚至到了有些束縛自己的程度。艾蕾什基伽勒是伊絲塔的姐姐，數次假裝是伊絲塔並接近藤丸。")
]

let Servant = [
    characters(name:"李奧納多·達文西",cv:"坂本真綾",introduce:"    迦勒底英靈召喚的第三號成功例。迦勒底技術局的特別名譽顧問。職階為Caster。曾經在歐洲的各個領域留下了巨大的成就，被稱為“全能天才”的超級天才。因為太過於愛自己的傑作“蒙娜麗莎”而以其容姿再次出現在了現世。在穿越特異點這方面上提供技術支持。"),
    characters(name:"吉爾伽美什",cv:"關智一",introduce:"    在摯友恩奇都死後所啟程的不老不死之旅中歸來，現在為統治著古代美索不達米亞·烏魯克之地的賢王。在傳說中被稱為“見證一切之人”。時而冷酷。時而通理人情，嚴格領導著子民。"),
    characters(name:"恩奇都",cv:"小林優",introduce:"    經眾神之手製造而出的人偶，擁有超高戰鬥能力的“持有意識的寶具”。同時亦是自然和協調·一體化的大地分身，儘管作為吉爾伽美甚唯一的朋友經歷了諸多的冒險，卻仍還是在得到心靈之後，以人偶之身重歸大地。"),
    characters(name:"梅林",cv:"櫻井孝宏",introduce:"    吉爾伽美甚通過英靈召喚所召喚的從者。職階為Caster。真實身份是亞瑟王傳說中所出現的宮廷魔術師，人類與夢魔之間的混血兒。身為魔法師的能力處於最高位的水平，也是“看清世界之眼”——“千里眼”的持有者。"),
    characters(name:"安娜",cv:"淺川悠",introduce:"    受到聖杯的影響而顯現在了烏魯克之地，沒有禦主的“流浪從者”。職階為Lancer。為了實現某個目的而與梅林一起行動。溫和敦厚，拒絕和他人溝通交流的少女。特別討厭梅林。"),
    characters(name:"伊絲塔",cv:"植田佳奈",introduce:"    掌管豐收與戰爭、以及金星等諸多神性的美索不達米亞的女神。職階為Archer。自由自在的性格，非常喜歡寶石等美麗的事物。與吉爾伽美甚有著因緣，經常驅使“天舟馬安娜”襲擊烏魯克，但每次的結果都是落荒而逃。"),
    characters(name:"牛若丸",cv:"早見沙織",introduce:"吉爾伽美甚召喚出來的鎮守烏魯克北面城牆的威風凜凜的從者。職階為Rider。在戰場上冷酷無情，有著極高的天賦才能，同時也有明朗活潑、親近友善、對主君十分忠誠的一面。"),
    characters(name:"武藏坊弁慶",cv:"稻田徹",introduce:"    吉爾伽美甚召喚出來的鎮守烏魯克北面城牆的肉體強健的僧兵從者。職階為Lancer。即便是現代，在各種故事傳說種也都是廣受愛戴的形象。平時豪快爽朗，同時又有著厭惡戰爭的熱愛和平的一面。"),
    characters(name:"列奧尼達一世",cv:"三木真一郎",introduce:"    吉爾伽美甚召喚出來的鎮守烏魯克北面城牆的滿腦肌肉的從者。職階為Lancer。以為了守護希臘而率領岌岌三百人的斯巴達軍隊抵擋了波斯大軍的入侵而為人所知。"),
    characters(name:"豹人",cv:"伊藤美紀",introduce:"    顯現現界原因仍不明的從者，很有可能是跟隨某個從者一起來到現界。職階為Lancer。充滿野性，自由奔放完全就是她的代名詞。穿在身上的似乎不是玩偶裝，而是“豹子的毛皮”……"),
    characters(name:"戈爾貢",cv:"淺川悠",introduce:"    擔任三女神同盟的盟主，企圖滅絕人類的從者。職階為Avenger。以烏魯克北面的山岳地帶為據點，有著能夠化作蟒蛇的觸手，已經是應該被稱為魔獸女王的存在了。"),
    characters(name:"魁札爾・科亞特爾",cv:"遠藤綾",introduce:"    三女神同盟的一柱，以烏魯克南方為據點的從者。職階為Rider。儘管她的性格像太陽一樣熾熱明亮，卻會在正面戰鬥中顯露出兇猛殘酷的一面。"),
    characters(name:"艾蕾什基伽勒",cv:"植田佳奈",introduce:"    三女神同盟的一柱，以冥界為據點的女神。性格認真，甚至到了有些束縛自己的程度。艾蕾什基伽勒是伊絲塔的姐姐，數次假裝是伊絲塔並接近藤丸。")
    
]

let Plot = [
    episode(Num:"0",Head:"旅途的開始",Plot:"人理延續保障機構.迦勒底，長年觀測到諸多證據證實2017年人類即將滅絕，為了延續人類的生存，迦勒底進行製造亞從者實驗，以獲得對抗威脅的武器。羅馬尼不忍心實驗體──名為瑪修的少女飽受肉體折磨又要背負如此沉重的責任，自願擔任她的主治醫師照顧她。"),
    episode(Num:"1",Head:"絕對魔獸戰線巴比倫尼亞",Plot:"藤丸和瑪修在Dr.羅曼和達.文西的安排之下，進行了第七次聖杯探索。這次探索的時代是公元前的世界──美索不達米亞文化。突然冒出大量的魔獸襲擊而來，藤丸和瑪修奮力抵抗才得以脫困。魔獸氾濫的問題，正在侵蝕這片原本繁盛昌隆的土地。"),
    episode(Num:"2",Head:"城塞都市烏魯克",Plot:"在恩奇都的帶領之下，藤丸和瑪修慢慢地朝著烏魯克前進。在濃密的森林裡遇到了迷路的旅人，    帶著名為安娜的小女孩，藤丸等人自我介紹之後，旅人表示恩奇都早已過世，眼前的恩奇都應該是個假貨，此時恩奇都突然露出詭計被揭穿的面貌，氣氛突然緊張了起來，三方人馬進入備戰狀態。"),
    episode(Num:"3",Head:"王與臣民",Plot:"吉爾伽美什王是個性格陰晴不定的人，不但不願聽從藤丸表達來意，反而要藤丸拿出實力一戰。戰敗的藤  丸雖然暫時無法晉見王，王仍然下令輔佐官西杜里照顧藤丸等人基本所需，並且安排工作讓他們調節烏魯克生活。在烏魯克地下的空洞地區隱藏著許多惡靈，安娜猜測……"),
    episode(Num:"4",Head:"密林的呼喚聲",Plot:"來到烏魯克已經一個月，在藤丸和瑪修的努力之下，吉爾伽美什王終於主動接見，並給予他們調查遠  方城市──烏爾市的機會。穿過悶熱又茂密的叢林，藤丸一行人抵達烏爾市，但市區內卻沒有受到魔獸侵擾。藤丸對烏爾市民說救援隊很快就會引導他們去烏魯克避難，但是烏爾市民表示不需要救援？"),
    episode(Num:"5",Head:"吉爾伽美什遊記",Plot:"吉爾伽美什王親自指派任務給藤丸，而且指定只要藤丸和瑪修兩個人去。這次的任務是波斯灣觀測  站的水質調查，調查工作之餘亦能欣賞波斯灣的美景。根據Dr.羅曼所說，第七特異點的規模是史上最大的，正當瑪修對此感嘆不已的時候，雷達上出現 一個不明目標以時速500公里的速度朝藤丸等人接近。"),
    episode(Num:"6",Head:"天命泥板",Plot:"北部壁壘地區的戰事持續，列奧尼達將軍等人死守前線。吉爾伽美什王命藤丸前往庫撒，回收以前留在那 裡的天命泥板。藤丸一行人來到庫撒，發現那裡彷彿時間停止一般，整座城市陷入一片死氣沉沉的寂靜。梅林提議分頭去找泥板，突然間藤丸的生物反應消失在迦勒底的監控屏幕上。"),
    episode(Num:"7",Head:"聲東擊西作戰",Plot:"受吉爾伽美甚王之託，藤丸等人來到北部壁壘，戰場前線的規模已經發展到一個城市的大小。面對  各種魔獸不定時的侵擾，藤丸和瑪修首次見到斯巴達王列奧尼達英勇奮戰的姿態，以及利用吉爾伽美甚王財寶為燃料的巨砲──神權印章。軍隊來到尼普爾，沿著滿地血痕循跡前進，在那盡頭站著的是……"),
    episode(Num:"8",Head:"魔獸母神",Plot:"魔獸之母──迪亞馬特降臨尼普爾，同行的軍隊死傷大半。梅林本來打算用夢魔血統帶來的不死之身，與   迪亞馬特一較生死，卻發現迪亞馬特擁有將萬物石化的魔眼…。面對魔獸女神強大的破壞力，連瑪修的盾牌也擋不住女神的攻勢。此時，晴朗的空中，突然落下一個熟悉的身影。"),
    episode(Num:"9",Head:"早安，金星女神",Plot:"藤丸等人失去了牛若丸和列奧尼達一世。聽了從神塔歸來的一行人的報告的吉爾伽美什，判定為了  能對抗戈爾貢，得依序來攻略三女神才行。於是便下令要藤丸去將伊絲塔給變成同伴。帶著吉爾伽美什所賦予的“錦囊妙計”，藤丸等人前往伊絲塔所在的神殿。"),
    episode(Num:"10",Head:"你好，太陽女神",Plot:"藤丸等人順利讓伊絲塔成為同伴後，從吉爾伽美什那得知南邊的密林．埃里都保管著作為打倒    戈爾貢的關鍵「馬爾杜克的斧頭」。而且才從伊絲塔那得知以埃里都為據點的密林女神的真名的同時，沒想到密林的女神竟然突襲烏魯克。對於一邊笑一邊攻擊人類的密林女神，急忙趕過去的藤丸等人抱持著戰鬥的覺悟。此時，女神開始說起“某件事情”起來"),
    episode(Num:"11",Head:"太陽神殿",Plot:"藤丸等人輕易就讓豹人成為同伴，在埃里都遇見了原以為死去的烏魯克的士兵們。知道他們平安無事 後，一行人得找出打倒魁札爾．科亞特爾的活路。然後，終於到了埃里都 的太陽神殿，並對三女神同盟之一的魁札爾．科亞特爾發起挑戰。為了破    壞太陽祭壇而在不斷猛攻的過程中，藤丸借助伊絲塔的力量，賭上靈魂獨自面對魁札爾．科亞特爾。"),
    episode(Num:"12",Head:"王之死",Plot:"吉爾伽美什因過勞而永遠沉眠…。這讓藤丸等人不禁動搖起來。不僅這樣，陸續還傳來烏魯克的市民們衰 弱死亡的報告。一行人推測其原因在於三女神同盟之一“冥府的女主人”。於是便在伊絲塔的陪同下前往冥界，打倒女神並解放吉爾伽美什的靈魂  ――。"),
    episode(Num:"13",Head:"再見，冥界女神",Plot:"終於和冥界女神．埃列什基迦勒碰面，藤丸希望她能一起來拯救烏魯克。但埃列什基迦勒並未回   應他的請求，並朝他們展開攻擊。借助吉爾伽美什和伊絲塔的力量，藤丸詢問著埃列什基迦勒的內心…。和為了盡上女神的職務的埃列什基迦勒展開一場激烈戰鬥，這場戰鬥的結果，只能寄託在瑪修的寶具「Lord．Camelot」上。"),
    episode(Num:"14",Head:"決戰",Plot:"和冥界女神．埃列什基迦勒達成和解，順利從冥界返回烏魯克的藤丸等人是前往吉爾伽美什之處。和戈爾貢的  最終決戰迫在眉梢，吉爾伽美什向藤丸等人提出打破困境的方案。那就是在她再次侵略前，早先一步前往戈爾貢的根據地去突襲鮮血神殿。就在賭上烏魯克的命運之際，前往北壁的藤丸等人，在這裡梅林觸及到了安娜的回憶。"),
    episode(Num:"15",Head:"新人類的形態",Plot:"透過馬爾杜克的斧頭，成功降低了戈爾貢的神性，藤丸一行人終於抵達了鮮血神殿的最深處。戈爾貢  透露，她將會為了復仇毀滅人類，但安娜釋放了一直被她抑制的神性，發動了攻擊。安娜的魔眼能抵銷哥爾貢的魔眼，而那把鐮刀是對抗不死的女神的唯一辦法。無論受到什麼攻擊都能再生的戈爾貢，安娜的鐮刀是否能命中――。"),
    episode(Num:"16",Head:"覺醒",Plot:"拉夫姆的攻擊使金古體內的聖杯顯現出來。被奪走聖杯，拼死逃進森林的金古還是被拉夫姆找到了，帶著悔恨  做好了最後的覺悟，就在這時，讓金古難以置信的光景就在他的眼前發生了――。與此同時，正在追趕著持有聖杯的拉夫姆的藤丸一行人，眼前出現的那個從者，明明應該逝去了才對...?"),
    episode(Num:"17",Head:"國會舞曲",Plot:"透過拉夫姆回收的聖杯之力，波斯灣變成了黑泥的海洋，它觸及的一切都化為了魔獸。隨著黑泥的逼近   ，藤丸下定決心要為了烏魯克擊破一切的根源――迪亞馬特。對著在波斯灣中心的迪亞馬特，藤丸用上令咒，與伊絲塔一同展開猛攻。"),
    episode(Num:"18",Head:"起源之星，仰望星空",Plot:"決戰前的最後一個夜晚，藤丸與瑪修以及女 神們在束之間度過了一段 平靜的時光。同個   夜晚，王拜訪了吉格拉特的頂部，在那裡，一個傷重到站不起來的人物出現在他的面前...。在那之後迎來了早晨，懷抱著吉爾伽美什王的話語，藤丸    一行人對迪亞馬特再度展開了攻擊。"),
    episode(Num:"19",Head:"絕對魔獸戰線美索不達米亞Ⅰ",Plot:"在魁札爾・科亞特爾絕死的攻擊下仍然健在的迪亞馬特面前，戈爾貢突然地出現了   。為了粉碎迪亞馬特的翅膀，戈爾貢解放了寶具，但仍然無法阻止祂進入烏魯克。藤丸一行人回到了吉格拉特，與吉爾伽美什王一同迎戰迪亞馬特。在烏魯克所設置的王的寶具“神權印章”火力全部解放，給迪亞馬特造成了傷害，但瞄準了那一瞬的空隙，吉爾伽美什王被擊中了。"),
    episode(Num:"20",Head:"絕對魔獸戰線美索不達米亞Ⅱ",Plot:"被帶到冥界的迪亞馬特轉變為人類惡――『Beast Ⅱ』，但祂的不死性被顯  現的山之翁――哈桑．薩巴赫的力量給奪走了。Beast Ⅱ並沒有消滅，而是在藤丸的呼喊與伊絲塔的攻擊下沿著冥界的岩壁攀爬而上。而在即將 回到地面的Beast Ⅱ面前出現的是――。"),
    episode(Num:"21",Head:"Grand Order",Plot:"在眾多的犧牲下，成功擊退Beast Ⅱ的藤丸一行人，滿身瘡痍的他們恢復意識之時，映入眼簾的是即將崩壞，滿目瘡痍的烏魯克。在這次的旅途結束之時，他們得到的事物是―――")
]
